# Task作成ページ

* todoアプリにアクセスする

## ユーザーは戻るボタンをクリックすると一覧画面に遷移する
* タスクの新規作成ボタンをクリックする
* タスクの新規作成画面が表示されている
* 戻るボタンをクリックする
* やることの一覧が表示されている

## ユーザーは作成画面でタイトルを入力することができる
* タスクの新規作成ボタンをクリックする
* タイトルのラベルに"Title"が表示されている
* タイトルの入力欄が表示されている
* タイトルに"今日はこれをやる"と入力する
* タイトル入力欄に"今日はこれをやる"と表示されている

## ユーザーは作成画面で詳細を入力することができる
* タスクの新規作成ボタンをクリックする
* 詳細のラベルに"Description"と表示されている
* 詳細の入力欄が表示されている
* 詳細入力欄に"今日やることの詳細です¥n二行目です"と入力する
* 詳細入力欄に"今日やることの詳細です¥n二行目です"と表示されている

## ユーザーは登録ボタンを押したらタスクを登録することができる
tags: unimplemented
* タスクの新規作成ボタンをクリックする
* タイトルに"今日はこれをやる"と入力する
* 詳細入力欄に"今日やることの詳細です¥n二行目です"と入力する
* タスクの登録ボタンをクリックする
*DBに"create_task"のデータが登録されたこと